import './App.css';
import ChuckNorris from './components/ChuckNorris';

// Задание 1

// Создать приложение на React для отображения случайных шуток о Чаке Норрисе.
// Мы будем использовать Chuck Norris API, который предоставляет случайные шутки о Чаке Норрисе. Этот API не требует ключа для доступа, что делает его идеальным для обучения.
// Инициализируйте новый проект с помощью Create React App.
// Разработайте интерфейс с кнопкой, при нажатии на которую будет отправляться запрос к API для получения новой шутки.
// Используйте fetch вместе с Promise или async/await для выполнения запроса к Chuck Norris API и получения случайной шутки.
// Отобразите полученную шутку в вашем интерфейсе. Можете добавить какой-нибудь элемент анимации или визуализации при загрузке данных.

function App() {
	return (
		<>
			<ChuckNorris />
		</>
	);
}

export default App;
